[
    {
        "name": "Poached Eggs and Bagels",
        "pic": "poached_eggs_and_bagels.jpg",
        "isVegetarian": true,
        "tags": [
            "Serves 1-2"
        ],
        "about": "A solid way to start your day, I have it pretty much every morning for breakfast with a mug of coffee. Can't for the life of me remember if I got this recipe from someone else or developed it myself, but I suspect the latter.",
        "ingredients": [
            "2 eggs",
            "1 bagel",
            "Cream cheese",
            "Sunflower seeds",
            "Pumpkin seeds",
            "Parmesan"
        ],
        "instructions": [
            "Set a saucepan half to two-thirds filled with water to high heat.",
            "Crack the eggs into a small bowl.",
            "When it's boiling, whisk it to create a vortex, and gently drop the eggs into the center. Put the lid on, turn off the heat, and set a timer for 3 and a half to 4 minutes, depending on how runny you want the eggs.",
            "While you're waiting, slice the bagel, spread cream cheese on both halves and sprinkle the seeds on top - pumpkin first then sunflower, for the optimal spread.",
            "When the eggs are done, scoop them out with a big serving spoon and drop them each on a bagel.",
            "Season liberally with pepper (and salt if you like, I don't care for it myself), and paremsan."
        ],
        "notes": [
            "If memory serves, I learned this method for poaching eggs from Gordon Ramsey, and it's never let me down. The trick is to whisk as fast as you can and immediately drop the eggs in. If you wait too long, the vortex will fade and the eggs will not stay together."
        ]
    },
    {
        "name": "Dad's Fabulous Chilli",
        "pic": "dads_fabulous_chilli.jpg",
        "tags": [
            "Serves 9-12"
        ],
        "about": "Most of the recipies I know come from my Mom. This is one of the few exceptions. It remains to this day the best chilli recipe I know, and it always reminds me of my Dad and the times we cooked it together. Invariably, he would forget one of the ingredients. This was such a consistent happenstance that it became a running joke that forgetting an ingredient was tradition. As such, each time he made it, it was a little bit different. Regardless, it always had a certian signature flavour that can't be beaten by any other chilli recipe. I highly recommend eating this with cornbread or <a class='quickLink' href='#moms_cheese_biscuits'>Cheese Biscuits</a>.",
        "ingredients": [
            "1 lb lean ground beef",
            "1 pack smoked bacon (chopped into small squares)",
            "3 cans of chopped tomatoes",
            "A pack of white mushrooms (chopped)",
            "3 bell peppers (chopped)",
            "An onion (chopped)",
            "A large tin of kidney beans",
            "Garlic (chopped finely) or garlic paste",
            "Ketchup (~2 tbsp)",
            "A small can of tomato paste",
            "Thyme, rosemary, marjoram, basil (2 tbsp mix)",
            "Oregano (1 tbsp)",
            "Pasta (fusilli)",
            "Aged Cheddar (grated)"
        ],
        "instructions": [
            "Brown the beef and the bacon.",
            "Add tomatoes, onion, peppers, and mushrooms.",
            "Drain, rinse and add the kidney beans.",
            "Add everything else but the cheese.",
            "Simmer on low for about an hour, stirring regularly.",
            "Boil the pasta and serve, garnishing with cheese."
        ],
        "notes": [
            "Every person I've ever met has claimed that chilli should be eaten with rice. They are all wrong. The correct way to eat chilli is with fusilli pasta. This is because that's the way Dad always served this chilli recipe, and if you disagree, you simply haven't experienced the majesty of chilli with fusilli. The chilli gets locked into all the twists, and it's just so delicious! Try it! You'll never go back!",
            "A lazy alternative to pasta or rice that I occasionally restort to is na'an bread. I've had a lot of issues in the past overeating because I underestimated the amount of pasta I was making. I've found portion control to be a lot easier with na'an.",
            "One of the best things about chilli is that it's a fantastic freezer meal. When I make a batch, I typically eat leftovers for a day or two, then freeze the rest. 2-3 serving spoons-worth in a ziplock bag is usually about a portion for me, and I easily end up with 6 or more bags."
        ]
    },
    {
        "name": "Rice with Onions",
        "pic": "rice_with_onions.jpg",
        "isVegetarian": true,
        "tags": ["Serves 1+"],
        "about": "Less of a meal on its own, this is the traditional recipe I follow for any situation where I need to make rice. It's part of every recipe of my grandfather's that involves making rice and it always turns out great! If you're feeling lazy, you can skip the onion and just follow the rest of the instructions for plain rice. If you want to make a large batch for several people, just multiply the amounts by the number of people.",
        "ingredients": [
            "1/2 cup of rice",
            "3/4 cup of water",
            "1/3 onion (chopped)",
            "A pinch of salt"
        ],
        "instructions": [
            "Saute the onion in a saucepan with a bit of oil or butter for 3-5 minutes.",
            "Add the rice, and stir it around a bit to make sure it's fully mixed with the onion.",
            "Add the water, and salt if desired. If you're making a big batch of rice, the ratio should always be 2 parts rice, 3 parts water. Set the burner to maximum.",
            "As the water evaporates, wait until it dips below the level of the rice. Then put the lid on and turn the burner to low.",
            "Wait 15-20 minutes for it to cook. Then serve with your preferred meal."
        ],
        "notes": [
            "You may choose to wash your rice first before adding it to the saucepan, to remove some of the starch. This causes it to come out fluffier.",
            "When putting the lid on, the amount of water still inside determines how mushy or dry the rice will be. The more water, the mushier the rice. It takes practice to figure out what your preference is, but as a general rule, you should be seeding drops of condensation on the inside of the lid after 10-20 seconds. If your lid isn't transparent, you can lift it up just to see.",
            "If cooking a larger batch of rice, you'll have to let more water evaporate than you might expect. The exact timing depends on the amount of rice you're cooking and how deep the pot is that you're cooking in (or rather, how deep the rice is)."
        ]
    },
    {
        "name": "Italian Sausage Soup",
        "tags": [
            "Serves 6-8"
        ],
        "about": "This is a definite favourite meal of mine. Apparently it was originally a recipe by Rachael Ray, but my mother has been making it for years and put her own spin on it. Spicy and delicious, I love making it when I feel glum and just need to be reminded of home. I highly recommend eating this with Mom's Tasty <a class='quickLink' href='#moms_cheese_biscuits'>Cheese Biscuits</a>.",
        "ingredients": [
            "4-6 Italian sausages",
            "A bunch of kale (or spinach)",
            "1 can of chopped tomates",
            "1 can of mixed beans",
            "6 cups of water",
            "2 beef stock cubes",
            "1 cup of Macoroni",
            "Garlic",
            "Basil",
            "Cheese"
        ],
        "instructions": [
            "Remove the sausages from their casings and brown them in a big pot, breaking them up as you do. Add the garlic (chopped or minced) when they're about halfway brown.",
            "When the sausages are brown, add the tomatoes, water, beef stock, beans and season with basil, salt and pepper to taste. Bring to a boil.",
            "Add the Macoroni and bring to a simmer until the macoroni is cooked.",
            "Add the kale and continue simmering for another 10-15 minutes.",
            "Garnish with cheese, then serve."
        ],
        "notes": [
            "For the cheese, I recommend Monterey Jack or Cheddar."
        ]
    },
    {
        "name": "Tortellini Soup",
        "pic": "tortellini_soup.jpg",
        "tags": [
            "Serves 6-8"
        ],
        "about": "One of the classic meals my mother used to make, this soup is one of my biggest comfort foods. She whipped it together on one of those occasions when she didn't know what to make and just used what she had. What we ended up with was a popular family favourite!",
        "ingredients": [
            "A large pack of fresh Tortellini",
            "A smoked polish sausage (skinned, sliced)",
            "An onion (chopped)",
            "A can of chopped tomates",
            "2 stock cubes",
            "A can of chick peas or mixed beans",
            "Garlic (chopped)",
            "Cheese (grated)",
            "Fresh bread"
        ],
        "instructions": [
            "Fry the onion in oil for about 3 minutes.",
            "Add the sausage and continue frying for 3-5 minutes.",
            "Add the garlic and tomatoes, and fill the pot with water until it's around 3/4 full. Add the stock cubes.",
            "Drain and rince the beans or chick peas, and add them. Bring to a boil and then simmer for about 10 minutes.",
            "Add the tortellini, and stir well. Turn off the burner and cover the pot. Leave for 10-15 minutes.",
            "Serve in a large bowl, garnished with cheese, alongside a slice or two of lovely bread."
        ],
        "notes": [
            "For the cheese, I recommend Monterey Jack or Cheddar.",
            "If you intend to eat this slowly over the course of a few days as leftovers, or if you freeze it, I recommend cooking the tortellini only on the day you eat it. As leftovers, the pasta gets soggy and unpleasant very quickly. Easiest way to do it is separate the portion of the soup you intend to eat as you make it, then cook the amount of tortellini you want in that. Then you can store the pasta-less remainder in the fridge or freezer, as desired."
        ]
    },
    {
        "name": "Paneer Curry",
        "pic": "paneer.jpg",
        "isVegetarian": "true",
        "tags": ["Serves 4-6"],
        "about": "An absolutely fantastic spicy meal. It's not the easiest thing to find, but if you do happen to get your hands on some paneer, this recipe is a great way to make it. I usually stock up on paneer because it freezes really well.",
        "ingredients": [
            "A pack of paneer (indian cheese)",
            "A can of chopped tomates",
            "1/2 cup table cream",
            "1/2 cup of peas",
            "Ginger",
            "Garlic (chopped)",
            "A tbsp total of Indian chili powder, garem masala, black mustard seeds, cumin seeds, corriander powder, cumin powder",
            "Rice or na'an bread",
            "Cilantro for garnish"
        ],
        "instructions": [
            "Cut the paneer into cubes. Heat 1/2 inch of oil in a large frying pan (medium heat). Brown the paneer on both sides.",
            "As the paneer is finished, pull out the pieces and place them on a paper towel to absorb the excess oil.",
            "Drain the oil, leaving about 4 tablespoons' worth. Grate in the ginger and add the garlic, stirring for 30 seconds.",
            "Add the spices, and stir for 45-60 seconds. Make sure it doesn't burn.",
            "Add the tomatoes and about half an inch of water. Stir and bring to a boil. Then cover and reduce to a simmer.",
            "Set rice going.",
            "Cook the tomatoes until it's really incorporated fully (15 minutes or so).",
            "Add the paneer, and let it sit for a while on low heat.",
            "Add the peas. Add water if it's too dry. Let the peas soften.",
            "Add cream, and salt to taste.",
            "Serve with rice or na'an bread. Garnish with cilantro."
        ],
        "notes": ["If you're working with frozen paneer, make sure you move it to the fridge the day before to defrost. I don't recommend trying to thaw it in water because I find it gets very crumbly and that makes frying it harder."]
    },
    {
        "name": "Italian Sausage and Zucchini",
        "pic": "sausage_zucchini.jpg",
        "tags": [
            "Serves 4-6"
        ],
        "about": "One of my Grandy's recipes, and probably one of my all time favourite dinners. He made this for us once on one of our trips to Florida where he and my Grandma lived. Apparently he adapted it from an old French recipe. Quick, easy, delicious! For the complete experience, make sure you use Grandy's <a class='quickLink' href='#rice_with_onions'>Rice with Onions</a> recipe too.",
        "ingredients": [
            "4-6 hot italian sausages (sliced)",
            "An onion (chopped)",
            "1 can of chopped tomates",
            "2-3 zuchinnis (sliced)",
            "Fennel seeds (crushed)",
            "1 and a half cups of water",
            "Rice"
        ],
        "instructions": [
            "Fry the onion in oil for about 3 minutes.",
            "Add the sausages and cook until they're brown.",
            "Add the tomatoes, fennel seeds, zuchinni and water. Bring to a boil, then cover and reduce to a gentle simmer for at least 15 minutes.",
            "Cook the rice.",
            "When the rice is ready, serve on a plate or bowl, spooning the sauce over it."
        ],
        "notes": [
            "For the cheese, I recommend Monterey Jack or Cheddar."
        ]
    },
    {
        "name": "Mom's Cheese Biscuits",
        "pic": "moms_cheese_biscuits.jpg",
        "isVegetarian": "true",
        "tags": ["Makes 10-12 Biscuits"],
        "about": "Delicious, soft and puffy, these biscuits will go great with any soup or chilli on this list.",
        "ingredients": [
            "2 Cups Bisquick biscuit mix",
            "2/3 cup milk",
            "1/2 cup cheddar cheese (shredded)",
            "1/4 cup butter (melted)",
            "1/4 tsp garlic powder",
            "1/4 tsp dried parsely"
        ],
        "instructions": [
            "Preheat oven to 450 degrees",
            "Mix biscuit mix, milk and cheese until soft dough forms, and beat vigorously for 30 seconds.",
            "Drop dough by spoonfuls onto a greased cookie sheet. Bake for 8-10 minutes or until golden brown.",
            "Mix butter, garlic powder, and dried parsley. When the biscuits are done, slather the mix over them before removing them from the cookie sheet.",
            "Serve warm."
        ],
        "notes": []
    },
    {
        "name": "Picadillo",
        "pic": "picadillo.jpg",
        "tags": [
            "Serves 4-6"
        ],
        "about": "A traditional South American dish, picadillo comes in innumerable variations. This is the one I'm used to. It's absolutely delicious and well worth trying if you want a hearty, flavourful meal.",
        "ingredients": [
            "1 lb lean ground beef",
            "2 large tomatoes (chopped)",
            "1.5 tbsp Tomato paste",
            "1 onion (chopped)",
            "1 large cubanelle pepper (chopped)",
            "1 medium potato (cubed)",
            "1 cup of water",
            "Green olives",
            "Rasins",
            "Beefstock",
            "Garlic (chopped)",
            "Ground cumin (1/2 - 3/4 tsp)",
            "Red pepper flakes (optional for extra spicy)",
            "Rice",
            "1 envelope of Sazon Goya seasoning (optional)",
            "cilantro (optional garnish)"
        ],
        "instructions": [
            "Brown the beef in a deep frying pan. When halfway done, add the onions and garlic.",
            "When done browning, drain the grease, add the tomatoes, tomato paste, cumin, Sazon Goya, peppers, potatoes, and a cup of water.",
            "Bring to a boil, then reduce to a simmer.",
            "Set rice going.",
            "Add olives and raisins. Cover, and simmer until the water has reduced a bit. Season with stock to taste.",
            "Simmer on very low for 15 minutes.",
            "serve with rice, garnish with cilantro."
        ],
        "notes": []
    },
    {
        "name": "Chana Masala",
        "pic": "chana_masala.jpg",
        "isVegetarian": "true",
        "tags": [
            "Serves 4-6"
        ],
        "about": "I got this recipe from my friend Owen, and it's a great go to meal.",
        "ingredients": [
            "1 onion",
            "1-3 jalapenos",
            "1 can of diced tomates",
            "1 can of chick peas",
            "1/2 cup of water",
            "Rice or na'an bread",
            "Lime juice or white vinegar",
            "Ginger",
            "Garlic (chopped)",
            "Tumeric (1/2 - 1 tbsp)",
            "Sugar (1 tbsp)",
            "Garem Masala (1 tbsp)"
        ],
        "instructions": [
            "Saute onion in some oil. While that's going, slice the jalapenos into quarters, then slice into small chunks. You can remove the seeds if you desire a less skin-meltingly spicy experience.",
            "Add the garlic, ginger, and garem masala. Continue frying for 45-60 seconds.",
            "Add tomates, chick peas, and water. Then add the tumeric.",
            "Cook on medium for at least 30 minutes.",
            "Add sugar and lime juice. Salt and pepper to taste.",
            "Serve with rice or na'an bread."
        ],
        "notes": ["Customizing the spice level of this is easy. The mildest experience is 1 jalapeno without seeds. You can either keep the seeds, or add additional jalapenos to boost the spiciness. Or do both if you can handle the heat. I usually do one jalapeno with seeds, and that works for me."]
    },
    {
        "name": "Kalar's Sauce",
        "isVegetarian": "true",
        "tags": [
            "Serves 4-6"
        ],
        "about": "This recipe originally came from The River Cafe in London. It's an authentic Italian tomato sauce. The reason we call it Kalar's Sauce is because when our dog, a border collie called Kalar (named after the Star Trek character), got lymphoma and was on chemotherapy, she'd lost her appetite and my mother tried a lot of different things to get her to eat. One day, she'd made this sauce and offered her a bit. She ate it. So to get her to eat, she put this sauce on her food and she'd eat it. That's how it became known as Kalar's Sauce.",
        "ingredients": [
            "2-3 large cans of chopped tomatoes",
            "Lots of grated garlic",
            "Lots of fresh basil",
            "Lot of olive oil",
            "Salt and pepper to taste",
            "Pasta (spaghetti or fusilli are good)",
            "Parmesan"
        ],
        "instructions": [
            "In a large pot, add some oil and turn the heat to medium high.",
            "Add the garlic and tomatoes. You want to get a nice steady rolling boil. The point is to reduce the tomatoes to a nice thickish, saucy consistency. The exact time depends on the amount of water in the tomatoes, but it doesn't need to be precise. Keep an eye on it and stir frequently so it doesn't burn.",
            "When it's nice and thick, take it off the burner and add the basil, salt and pepper. Stir well and leave it for a while. An hour is ideal.",
            "Serve on pasta with Parmesan."
        ],
        "notes": [
            "If you want some meat, you can very easily throw in some Italian sausages and brown them in Step 1. Alternatively, cooking some frozen meatballs in the oven and dropping them in during Step 3 works great too!"
        ]
    }
]